PX4/PX4-Autopilot/platforms/nuttx/src/px4/stm/stm32_common/dshot/dshot.c
	// Initialize timer_config data based on enabled channels
	init_timer_config(channel_mask);

	// Initializes dshot on each timer if DShot mode is enabled and DMA is available
	init_timers_dma_up();

	int32_t channels_init_mask = 0;

	for (uint8_t timer_index = 0; timer_index < MAX_IO_TIMERS; timer_index++) {
		channels_init_mask |= init_timer_channels(timer_index);
	}

	unsigned output_buffer_offset = 0;

	for (uint8_t timer_index = 0; timer_index < MAX_IO_TIMERS; timer_index++) {
		if (timer_configs[timer_index].initialized) {
			if (io_timers[timer_index].base == 0) { // no more timers configured
				break;
			}

			// we know the uint8_t* cast to uint32_t* is fine, since we're aligned to cache line size
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wcast-align"
			dshot_output_buffer[timer_index] = (uint32_t *) &dshot_burst_buffer_array[output_buffer_offset];

#pragma GCC diagnostic pop
			uint32_t channel_count = io_timers_channel_mapping.element[timer_index].channel_count_including_gaps;
			output_buffer_offset += DSHOT_OUTPUT_BUFFER_SIZE(channel_count);

			if (output_buffer_offset > sizeof(dshot_burst_buffer_array)) {
				return -EINVAL; // something is wrong with the board configuration or some other logic
			}
		}
	}

	// Mark BDShot channels without capture DMA as processed (so they don't block ready count)
	// and track which channels support capture
	for (uint8_t output_channel = 0; output_channel < MAX_TIMER_IO_CHANNELS; output_channel++) {
		if (bdshot_channel_mask & (1 << output_channel)) {
			uint8_t timer_index = timer_io_channels[output_channel].timer_index;
			uint8_t timer_channel = timer_io_channels[output_channel].timer_channel;

			if (timer_channel >= 1 && timer_channel <= 4) {
				uint8_t timer_channel_index = timer_channel - 1;

				if (io_timers[timer_index].dshot.dma_map_ch[timer_channel_index] != 0) {
					_bdshot_capture_supported[output_channel] = true;

				} else {
					// No DMA for capture on this channel
					PX4_WARN("BDShot capture not supported on output %u (no DMA)", output_channel);
				}
			}
		}
	}

	return channels_init_mask;
}

// ESC boot delay - wait for ESCs to initialize before enabling BDShot capture
static const uint64_t ESC_BOOT_DELAY_US = 3000000;

// Start burst DMA for a single timer
static void dshot_start_timer_burst(uint8_t timer_index)
{
	timer_config_t *timer = &timer_configs[timer_index];
	io_timer_channel_mode_t mode = timer->bidirectional ? IOTimerChanMode_DshotInverted : IOTimerChanMode_Dshot;

	io_timer_set_enable(true, mode, io_timer_get_group(timer_index));

	uint32_t channel_count = io_timers_channel_mapping.element[timer_index].channel_count_including_gaps;
	io_timer_set_dshot_burst_mode(timer_index, _dshot_frequency, channel_count);

	if (timer->bidirectional) {
		// Deallocate DMA from previous transaction
		if (timer->dma_handle != NULL) {
			stm32_dmastop(timer->dma_handle);
			stm32_dmafree(timer->dma_handle);
			timer->dma_handle = NULL;
		}

		// Allocate DMA
		timer->dma_handle = stm32_dmachannel(io_timers[timer_index].dshot.dma_map_up);

		if (timer->dma_handle == NULL) {
			PX4_WARN("DMA allocation for timer %u failed", timer_index);
			return;
		}
	}

	// Flush cache so DMA sees the data
	up_clean_dcache((uintptr_t)dshot_output_buffer[timer_index],
			(uintptr_t)dshot_output_buffer[timer_index] +
			DSHOT_OUTPUT_BUFFER_SIZE(channel_count));

	px4_stm32_dmasetup(timer->dma_handle,
			   io_timers[timer_index].base + STM32_GTIM_DMAR_OFFSET,
			   (uint32_t)(dshot_output_buffer[timer_index]),
			   channel_count * CHANNEL_OUTPUT_BUFF_SIZE,
			   DSHOT_DMA_SCR);

	// Clean UDE flag before DMA is started
	io_timer_update_dma_req(timer_index, false);

	// Trigger DMA. For BDShot after boot delay, use callback for capture setup.
	if (timer->bidirectional && (hrt_absolute_time() > ESC_BOOT_DELAY_US)) {
		perf_begin(bust_perf);
		stm32_dmastart(timer->dma_handle, dma_burst_finished_callback, &timer->timer_index, false);

	} else {
		// Standard DShot or BDShot during boot - no capture needed
		stm32_dmastart(timer->dma_handle, dma_burst_finished_callback, &timer->timer_index, false);

		if (timer->bidirectional) {
			// During boot, mark BDShot cycle complete immediately
			_bdshot_cycle_complete[timer_index] = true;
		}
	}

	// Enable DMA update request
	io_timer_update_dma_req(timer_index, true);
}

// Kicks off DMA transmit for all configured timers simultaneously
void up_dshot_trigger()
{
	for (int i = 0; i < MAX_IO_TIMERS; i++) {
		if (!_bdshot_cycle_complete[i]) {
			PX4_WARN("Cycle not complete, check system jitter!");
			return;
		}
	}

	// Mark all BDShot timers as cycle incomplete and start all timers
	for (uint8_t i = 0; i < MAX_IO_TIMERS; i++) {
		if (timer_configs[i].enabled && timer_configs[i].initialized) {
			if (timer_configs[i].bidirectional) {
				_bdshot_cycle_complete[i] = false;
			}

			dshot_start_timer_burst(i);

			// NOTE: small delay between timer bursts, workaround for race condition. The issue is that when timers
			// are burst at the same time, the response frame arrives at the same time. Response frames arrive 30us
			// after the burst is complete, and reconfiguring the first timer for capture-compare takes longer than
			// 15us. This means by the time the second timer is configured for capture-compare, we've already missed
			// some of the response frame bits.
			// NOTE: 24us stagger between Timer1Burst and Timer2Burst measured on an H7
			if (i < MAX_IO_TIMERS - 1) {
				px4_udelay(10);
			}
		}
	}
}

static void select_next_capture_channel(uint8_t timer_index)
{
	int current = timer_configs[timer_index].capture_channel;

	// Try each of the 4 possible channels, starting from current+1
	for (int i = 1; i <= 4; i++) {
		int next = (current + i) % 4;

		if (timer_configs[timer_index].initialized_channels[next]) {
			uint8_t output_channel = output_channel_from_timer_channel(timer_index, next);

			// Only capture from channels that support BDShot (have DMA mapping)
			if (_bdshot_capture_supported[output_channel]) {
				timer_configs[timer_index].capture_channel = next;
				return;
			}
		}
	}
}

static uint8_t output_channel_from_timer_channel(uint8_t timer_index, uint8_t timer_channel_index)
{
	for (uint8_t output_channel = 0; output_channel < MAX_TIMER_IO_CHANNELS; output_channel++) {

		bool is_this_timer = timer_index == timer_io_channels[output_channel].timer_index;
		uint8_t channel_index = timer_io_channels[output_channel].timer_channel - 1;

		if (is_this_timer && (channel_index == timer_channel_index)) {
			// We found the output channel associated with this timer channel
			return output_channel;
		}
	}

	// TODO: error handling?
	return 0;
}

