PX4/PX4-Autopilot/platforms/nuttx/src/px4/stm/stm32_common/dshot/dshot.c
void dma_burst_finished_callback(DMA_HANDLE handle, uint8_t status, void *arg)
{
	uint8_t timer_index = *((uint8_t *)arg);

	timer_config_t *timer = &timer_configs[timer_index];

	// For standard DShot or BDShot during boot: no capture needed
	if (!timer->bidirectional || (hrt_absolute_time() <= ESC_BOOT_DELAY_US)) {
		return;
	}

	// Clean DMA UP configuration
	if (timer->dma_handle != NULL) {
		stm32_dmastop(timer->dma_handle);
		stm32_dmafree(timer->dma_handle);
		timer->dma_handle = NULL;
	}

	// Disable DMA update request
	io_timer_update_dma_req(timer_index, false);

	// De-allocate timer
	io_timer_unallocate_timer(timer_index);

	// Flush cache so DMA sees the data
	memset(dshot_capture_buffer[timer_index], 0, sizeof(dshot_capture_buffer[timer_index]));
	up_clean_dcache((uintptr_t) dshot_capture_buffer[timer_index],
			(uintptr_t) dshot_capture_buffer[timer_index] + DSHOT_CAPTURE_BUFFER_SIZE(MAX_NUM_CHANNELS_PER_TIMER));

	// Re-initialize all output channels on this timer as CaptureDMA to ensure all lines idle high
	for (uint8_t channel = 0; channel < MAX_TIMER_IO_CHANNELS; channel++) {

		bool is_this_timer = timer_index == timer_io_channels[channel].timer_index;
		uint8_t timer_channel_index = timer_io_channels[channel].timer_channel - 1;
		bool channel_initialized = timer_configs[timer_index].initialized_channels[timer_channel_index];

		if (is_this_timer && channel_initialized) {

			io_timer_unallocate_channel(channel);
			// Initialize back to DShotInverted to bring IO back to the expected idle state
			io_timer_channel_init(channel, IOTimerChanMode_CaptureDMA, NULL, NULL);
		}
	}

	// Select the next capture channel
	select_next_capture_channel(timer_index);

	// Allocate DMA for currently selected capture_channel
	uint8_t capture_channel = timer_configs[timer_index].capture_channel;
	timer_configs[timer_index].dma_handle = stm32_dmachannel(io_timers[timer_index].dshot.dma_map_ch[capture_channel]);

	// If DMA handler is invalid, skip capture
	if (timer->dma_handle == NULL) {
		PX4_WARN("failed to allocate dma for timer %u channel %u", timer_index, capture_channel);
		_bdshot_cycle_complete[timer_index] = true;
		return;
	}

	// Set Capture mode for this channel
	io_timer_set_dshot_capture_mode(timer_index, capture_channel, _dshot_frequency);
	io_timer_capture_dma_req(timer_index, capture_channel, true);

	// Choose which CC register for this DMA stream
	uint32_t periph_addr = io_timers[timer_index].base + STM32_GTIM_CCR1_OFFSET + (4 * capture_channel);

	// Setup DMA for this channel
	px4_stm32_dmasetup(timer_configs[timer_index].dma_handle,
			   periph_addr,
			   (uint32_t) dshot_capture_buffer[timer_index][capture_channel],
			   CHANNEL_CAPTURE_BUFF_SIZE,
			   DSHOT_BIDIRECTIONAL_DMA_SCR);

	// NOTE: we can't use DMA callback since GCR encoding creates a variable length pulse train. Instead
	// we use an hrt callback to schedule the processing of the received and DMAd eRPM frames.
	stm32_dmastart(timer_configs[timer_index].dma_handle, NULL, NULL, false);

	// Enable CaptureDMA on this timer's channels only
	io_timer_set_enable(true, IOTimerChanMode_CaptureDMA, io_timer_get_group(timer_index));

	perf_end(bust_perf);
	perf_begin(capture_window_perf);

	// 30us to switch regardless of DShot frequency + eRPM frame time + 20us for good measure
	hrt_abstime frame_us = (16 * 1000000) / _dshot_frequency; // 16 bits * us_per_s / bits_per_s
	hrt_abstime delay = 30 + frame_us + 20;
	hrt_call_after(&_cc_calls[timer_index], delay, capture_complete_callback, arg);
}

static void capture_complete_callback(void *arg)
{
	perf_end(capture_window_perf);
	perf_begin(capture_complete_perf);

	uint8_t timer_index = *((uint8_t *)arg);

	// Unallocate the timer as CaptureDMA
	io_timer_unallocate_timer(timer_index);

	uint8_t capture_channel = timer_configs[timer_index].capture_channel;

	// Disable capture DMA
	io_timer_capture_dma_req(timer_index, capture_channel, false);

	// Stop DMA (should already be finished)
	stm32_dmastop(timer_configs[timer_index].dma_handle);

	// Re-initialize all output channels on this timer
	for (uint8_t output_channel = 0; output_channel < MAX_TIMER_IO_CHANNELS; output_channel++) {

		bool is_this_timer = timer_index == timer_io_channels[output_channel].timer_index;
		uint8_t timer_channel_index = timer_io_channels[output_channel].timer_channel - 1;
		bool channel_initialized = timer_configs[timer_index].initialized_channels[timer_channel_index];

		if (is_this_timer && channel_initialized) {
			io_timer_unallocate_channel(output_channel);
			// Initialize back to DShotInverted to bring IO back to the expected idle state
			io_timer_channel_init(output_channel, IOTimerChanMode_DshotInverted, NULL, NULL);
		}
	}

	// Invalidate the dcache to ensure most recent data is available
	up_invalidate_dcache((uintptr_t) dshot_capture_buffer[timer_index],
			     (uintptr_t) dshot_capture_buffer[timer_index] + DSHOT_CAPTURE_BUFFER_SIZE(MAX_NUM_CHANNELS_PER_TIMER));

	// Process eRPM frames from all channels on this timer
	process_capture_results(timer_index, capture_channel);

	// Enable this timer's channels as DShotInverted
	io_timer_set_enable(true, IOTimerChanMode_DshotInverted, io_timer_get_group(timer_index));

	perf_end(capture_complete_perf);

	_bdshot_cycle_complete[timer_index] = true;
}

void process_capture_results(uint8_t timer_index, uint8_t channel_index)
{
	uint8_t output_channel = output_channel_from_timer_channel(timer_index, channel_index);
	uint32_t value = convert_edge_intervals_to_bitstream(timer_index, channel_index);

	// Decode RLL
	value = (value ^ (value >> 1));

	// Decode GCR
	uint32_t payload = gcr_decode[value & 0x1f];
	payload |= gcr_decode[(value >> 5) & 0x1f] << 4;
	payload |= gcr_decode[(value >> 10) & 0x1f] << 8;
	payload |= gcr_decode[(value >> 15) & 0x1f] << 12;

	// Calculate checksum
	uint32_t checksum = payload;
	checksum = checksum ^ (checksum >> 8);
	checksum = checksum ^ (checksum >> NIBBLES_SIZE);

	if ((checksum & 0xF) != 0xF) {
		++read_fail_crc[output_channel];

		if (_consecutive_failures[output_channel]++ > BDSHOT_OFFLINE_COUNT) {
			_consecutive_failures[output_channel] = BDSHOT_OFFLINE_COUNT;
			_consecutive_successes[output_channel] = 0;
			_bdshot_online[output_channel] = false;
		}

		return;
	}

	++read_ok[output_channel];

