PX4/PX4-Autopilot/platforms/nuttx/src/px4/stm/stm32_common/dshot/dshot.c
	if (_consecutive_successes[output_channel]++ > BDSHOT_OFFLINE_COUNT) {
		_consecutive_successes[output_channel] = BDSHOT_OFFLINE_COUNT;
		_consecutive_failures[output_channel] = 0;
		_bdshot_online[output_channel] = true;
	}

	// Convert payload into telem type/value
	struct BDShotTelemetry packet = {};
	payload = (payload >> 4) & 0xFFF;
	decode_dshot_telemetry(payload, &packet);

	hrt_abstime now = hrt_absolute_time();

	switch (packet.type) {
	case DSHOT_EDT_ERPM: {
			_erpms[output_channel].erpm = packet.value;
			_erpms[output_channel].ready = true;

			uint64_t last_timestamp = _erpms[output_channel].last_timestamp;
			float last_rate_hz = _erpms[output_channel].rate_hz;
			_erpms[output_channel].rate_hz = calculate_rate_hz(last_timestamp, last_rate_hz, now);
			_erpms[output_channel].last_timestamp = now;
			break;
		}

	case DSHOT_EDT_TEMPERATURE: {
			_edt_temp[output_channel].value = packet.value;
			_edt_temp[output_channel].ready = true;

			uint64_t last_timestamp = _edt_temp[output_channel].last_timestamp;
			float last_rate_hz = _edt_temp[output_channel].rate_hz;
			_edt_temp[output_channel].rate_hz = calculate_rate_hz(last_timestamp, last_rate_hz, now);
			_edt_temp[output_channel].last_timestamp = now;
			break;
		}

	case DSHOT_EDT_VOLTAGE: {
			_edt_volt[output_channel].value = packet.value;
			_edt_volt[output_channel].ready = true;

			uint64_t last_timestamp = _edt_volt[output_channel].last_timestamp;
			float last_rate_hz = _edt_volt[output_channel].rate_hz;
			_edt_volt[output_channel].rate_hz = calculate_rate_hz(last_timestamp, last_rate_hz, now);
			_edt_volt[output_channel].last_timestamp = now;
			break;
		}

	case DSHOT_EDT_CURRENT: {
			_edt_curr[output_channel].value = packet.value;
			_edt_curr[output_channel].ready = true;

			uint64_t last_timestamp = _edt_curr[output_channel].last_timestamp;
			float last_rate_hz = _edt_curr[output_channel].rate_hz;
			_edt_curr[output_channel].rate_hz = calculate_rate_hz(last_timestamp, last_rate_hz, now);
			_edt_curr[output_channel].last_timestamp = now;
			break;
		}

	case DSHOT_EDT_STATE_EVENT:
		// TODO: Handle these?
		break;

	default:
		PX4_WARN("unknown EDT type %d", packet.type);
		break;
	}

}

float calculate_rate_hz(uint64_t last_timestamp, float last_rate_hz, uint64_t timestamp)
{
	if (last_timestamp == 0 || timestamp <= last_timestamp) {
		return last_rate_hz;
	}

	uint64_t dt_us = timestamp - last_timestamp;

	float instant_rate = 1000000.0f / dt_us;

	// Simple exponential moving average with fixed alpha
	// Alpha = 0.125 (1/8) works well across all rates
	float rate_hz = instant_rate * 0.125f + last_rate_hz * 0.875f;

	return rate_hz;
}

// Converts captured edge timestamps into a raw bit stream.
// Measures the time intervals between signal edges to determine how many consecutive
// 1s or 0s to shift in, alternating the bit value with each edge transition.
// Uses adaptive per-channel timing calibration to handle ESC oscillator variation.
// Returns a 20 bit raw value that still needs RLL and GCR decoding.
uint32_t convert_edge_intervals_to_bitstream(uint8_t timer_index, uint8_t channel_index)
{
	// First pass: collect all intervals
	uint32_t intervals[CHANNEL_CAPTURE_BUFF_SIZE];
	unsigned interval_count = 0;

	// We can ignore the very first data point as it's the pulse before it starts.
	unsigned previous = dshot_capture_buffer[timer_index][channel_index][1];

	for (unsigned i = 2; i < CHANNEL_CAPTURE_BUFF_SIZE; ++i) {
		if (dshot_capture_buffer[timer_index][channel_index][i] == 0) {
			// Once we get zeros we're through
			break;
		}

		uint32_t interval = dshot_capture_buffer[timer_index][channel_index][i] - previous;

		// Filter out noise: reject intervals <10 or >100 ticks
		if (interval >= 10 && interval <= 100) {
			intervals[interval_count++] = interval;
		}

		previous = dshot_capture_buffer[timer_index][channel_index][i];
	}

	if (interval_count == 0) {
		return 0;
	}

	// Calibrate base interval using minimum interval (always 1 bit in GCR)
	// The shortest valid interval in the frame represents a single bit period
	uint32_t min_interval = intervals[0];

	for (unsigned i = 1; i < interval_count; i++) {
		if (intervals[i] < min_interval) {
			min_interval = intervals[i];
		}
	}

	uint8_t output_channel = output_channel_from_timer_channel(timer_index, channel_index);

	// Update base interval with low-pass filter (10% weight on new measurement)
	// This adapts to each ESC's actual timing while filtering transient noise
	_base_interval[output_channel] = 0.9f * _base_interval[output_channel] + 0.1f * (float)min_interval;

	// Second pass: decode bits using adaptive threshold
	uint32_t value = 0;
	uint32_t high = 1;
	unsigned shifted = 0;

	float base = _base_interval[output_channel];

	for (unsigned i = 0; i < interval_count; i++) {
		// Convert interval to bit count using relative threshold
		// Round to nearest: 0.5-1.5 → 1, 1.5-2.5 → 2, 2.5-3.5 → 3, etc.
		float interval_f = (float)intervals[i];
		uint32_t bits = (uint32_t)((interval_f / base) + 0.5f);

		// Clamp to valid range (1-4 bits typical in GCR encoding)
		if (bits < 1) {
			bits = 1;

		} else if (bits > 4) {
			bits = 4;
		}

		// Shift in the bits
		for (unsigned bit = 0; bit < bits; ++bit) {
			value = (value << 1) | high;
			++shifted;
		}

		high = !high;
	}

	// Flexible frame validation: accept 18-24 bits instead of forcing exactly 21
	// This handles ESC timing variation and incomplete frames
	if (shifted < 18 || shifted > 24) {
		// Frame too short or too long - likely corrupted
		return 0;
	}

	// Pad to 21 bits for GCR decoder (which expects exactly 21 bits)
	if (shifted < 21) {
		value <<= (21 - shifted);

	} else if (shifted > 21) {
		// Trim excess bits (shouldn't happen often with proper decoding)
		value >>= (shifted - 21);
	}

	return value;
}

void decode_dshot_telemetry(uint32_t payload, struct BDShotTelemetry *packet)
{
	// Extended DShot Telemetry
	bool edt_enabled = _edt_enabled;
	uint32_t mantissa = payload & 0x01FF;
	bool is_telemetry = !(mantissa & 0x0100); // if the msb of the mantissa is zero, then this is an extended telemetry packet

