PX4/PX4-Autopilot/platforms/nuttx/src/px4/stm/stm32_common/dshot/dshot.c
	if (edt_enabled && is_telemetry) {
		packet->type = (payload & 0x0F00) >> 8;
		packet->value = payload & 0x00FF; // extended telemetry value is 8 bits wide

	} else {
		// otherwise it's an eRPM frame
		uint8_t exponent = ((payload >> 9) & 0x7); // 3 bit: exponent
		uint16_t period = (payload & 0x1FF); // 9 bit: period base
		period = period << exponent; // Period in usec

		packet->type = DSHOT_EDT_ERPM;

		if (period == 65408 || period == 0) {
			// 65408 is a special case for zero motion (e.g., stationary motor)
			packet->value = 0;

		} else {
			packet->value = (1000000 * 60 / 100 + period / 2) / period;
		}
	}
}

// bits  1-11  - throttle value (0-47 are reserved for commands, 48-2047 give 2000 steps of throttle resolution)
// bit   12    - dshot telemetry enable/disable
// bits  13-16 - XOR checksum
void dshot_motor_data_set(uint8_t channel, uint16_t data, bool telemetry)
{
	uint8_t timer_index = timer_io_channels[channel].timer_index;
	uint8_t timer_channel_index = timer_io_channels[channel].timer_channel - 1;
	bool channel_initialized = timer_configs[timer_index].initialized_channels[timer_channel_index];

	if (!channel_initialized) {
		return;
	}

	uint16_t packet = 0;
	uint16_t checksum = 0;

	packet |= data << DSHOT_THROTTLE_POSITION;
	packet |= ((uint16_t)telemetry & 0x01) << DSHOT_TELEMETRY_POSITION;

	uint16_t csum_data = packet;

	// XOR checksum calculation
	csum_data >>= NIBBLES_SIZE;

	for (uint8_t i = 0; i < DSHOT_NUMBER_OF_NIBBLES; i++) {
		checksum ^= (csum_data & 0x0F); // XOR data by nibbles
		csum_data >>= NIBBLES_SIZE;
	}

	if (_bdshot_channel_mask & (1 << channel)) {
		packet |= ((~checksum) & 0x0F);

	} else {
		packet |= ((checksum) & 0x0F);
	}

	const io_timers_channel_mapping_element_t *mapping = &io_timers_channel_mapping.element[timer_index];
	uint8_t num_motors = mapping->channel_count_including_gaps;
	uint8_t timer_channel = timer_io_channels[channel].timer_channel - mapping->lowest_timer_channel;

	for (uint8_t motor_data_index = 0; motor_data_index < ONE_MOTOR_DATA_SIZE; motor_data_index++) {
		dshot_output_buffer[timer_index][motor_data_index * num_motors + timer_channel] =
			(packet & 0x8000) ? MOTOR_PWM_BIT_1 : MOTOR_PWM_BIT_0;  // MSB first
		packet <<= 1;
	}
}

int up_dshot_arm(bool armed)
{
	int ret = PX4_OK;

	for (int timer_index = 0; timer_index < MAX_IO_TIMERS; timer_index++) {
		io_timer_channel_mode_t mode = timer_configs[timer_index].bidirectional ? IOTimerChanMode_DshotInverted : IOTimerChanMode_Dshot;
		ret |= io_timer_set_enable(armed, mode, io_timer_get_group(timer_index));
	}

	return ret;
}


int up_bdshot_num_errors(uint8_t channel)
{
	return read_fail_crc[channel];
}

int up_bdshot_get_erpm(uint8_t channel, int *erpm)
{
	uint8_t timer_index = timer_io_channels[channel].timer_index;
	uint8_t timer_channel_index = timer_io_channels[channel].timer_channel - 1;
	bool channel_initialized = timer_configs[timer_index].initialized_channels[timer_channel_index];

	int status = PX4_ERROR;

	if (channel_initialized && _erpms[channel].ready) {
		*erpm = _erpms[channel].erpm;
		status = PX4_OK;
	}


	return status;
}

int up_bdshot_get_extended_telemetry(uint8_t channel, int type, uint8_t *value)
{
	int result = PX4_ERROR;

	switch (type) {
	case DSHOT_EDT_TEMPERATURE:
		if (_edt_temp[channel].ready) {
			*value = _edt_temp[channel].value;
			_edt_temp[channel].ready = false;
			result = PX4_OK;
		}

		break;

	case DSHOT_EDT_VOLTAGE:
		if (_edt_volt[channel].ready) {
			*value = _edt_volt[channel].value;
			_edt_volt[channel].ready = false;
			result = PX4_OK;
		}

		break;

	case DSHOT_EDT_CURRENT:
		if (_edt_curr[channel].ready) {
			*value = _edt_curr[channel].value;
			_edt_curr[channel].ready = false;
			result = PX4_OK;
		}

		break;

	default:
		break;
	}

	return result;
}

int up_bdshot_channel_online(uint8_t channel)
{
	if (channel >= MAX_TIMER_IO_CHANNELS) {
		return 0;
	}

	return _bdshot_online[channel];
}

int up_bdshot_channel_capture_supported(uint8_t channel)
{
	if (channel >= MAX_TIMER_IO_CHANNELS) {
		return 0;
	}

	return _bdshot_capture_supported[channel];
}

void up_bdshot_status(void)
{
	PX4_INFO("dshot driver stats:");

	if (_bdshot_channel_mask) {
		PX4_INFO("BDShot channel mask: 0x%2x", (unsigned)_bdshot_channel_mask);

		// Show timer configuration
		for (int i = 0; i < MAX_IO_TIMERS; i++) {
			if (timer_configs[i].enabled) {
				PX4_INFO("Timer %d: enabled=%d init=%d bidir=%d cap_ch=%d",
					 i, timer_configs[i].enabled, timer_configs[i].initialized,
					 timer_configs[i].bidirectional, timer_configs[i].capture_channel);
			}
		}

		// Always show read counters for BDShot
		for (int i = 0; i < MAX_TIMER_IO_CHANNELS; i++) {
			if (_bdshot_channel_mask & (1 << i)) {
				if (_bdshot_capture_supported[i]) {
					PX4_INFO("Output %u: read_ok %lu, fail_crc %lu",
						 i, read_ok[i], read_fail_crc[i]);

				} else {
					PX4_INFO("Output %u: no DMA for capture", i);
				}
			}
		}
	}

	if (_edt_enabled) {
		PX4_INFO("BDShot EDT rates");

		for (int i = 0; i < MAX_TIMER_IO_CHANNELS; i++) {
			if (_bdshot_online[i]) {
				PX4_INFO("Ch%d:  eRPM: %dHz  Temp: %.2fHz  Volt: %.2fHz  Curr: %.2fHz",
					 i,
					 (int)_erpms[i].rate_hz,
					 (double)_edt_temp[i].rate_hz,
					 (double)_edt_volt[i].rate_hz,
					 (double)_edt_curr[i].rate_hz);
			}
		}
	}
}

#endif
